import React, { useEffect, useState } from "react";
import SelectBox from "@/components/SelectBox";
import Button from "@/components/Button";
import _toast from "@/utils/notification/toast";

const countries = ["ایران"];
export const provinces_with_cities = {
  "آذربايجان شرقي": [
    "اسكو",
    "اهر",
    "ایلخچی",
    "باسمنج",
    "بستان آباد",
    "بناب",
    "تبريز",
    "تسوج",
    "جلفا",
    "خسروشهر",
    "سراب",
    "سهند",
    "شبستر",
    "صوفیان",
    "مراغه",
    "مرند",
    "ملكان",
    "ممقان",
    "ميانه",
    "هاديشهر",
    "هريس",
    "هشترود",
    "ورزقان",
  ],
  "آذربايجان غربي": [
    "اروميه",
    "اشنويه",
    "بوكان",
    "تكاب",
    "خوي",
    "سر دشت",
    "سلماس",
    "شاهين دژ",
    "ماكو",
    "مهاباد",
    "مياندوآب",
    "نقده",
    "پلدشت",
    "پيرانشهر",
    "چالدران",
  ],
  اردبيل: ["اردبيل", "خلخال", "مشگين شهر", "نمين", "نير", "پارس آباد", "گرمي"],
  اصفهان: [
    "آران و بيدگل",
    "اردستان",
    "اصفهان",
    "باغ بهادران",
    "تودشک",
    "تيران",
    "حاجي آباد",
    "خميني شهر",
    "خوانسار",
    "درچه",
    "دهاقان",
    "زرين شهر",
    "سميرم",
    "شهرضا",
    "عسگران",
    "علويجه",
    "فلاورجان",
    "كاشان",
    "مباركه",
    "نجف آباد",
    "نطنز",
    "ورزنه",
    "کوهپایه",
    "گلپايگان",
  ],
  ايلام: ["آبدانان", "ايلام", "ايوان", "دره شهر", "دهلران", "سرابله", "مهران"],
  بوشهر: [
    "اهرم",
    "برازجان",
    "بوشهر",
    "جم",
    "خورموج",
    "دير",
    "عسلویه",
    "كنگان",
    "کاکی",
    "گناوه",
  ],
  تهران: [
    "اسلامشهر",
    "باقرشهر",
    "بومهن",
    "تجريش",
    "تهران",
    "دماوند",
    "رباط كريم",
    "رودهن",
    "ري",
    "شريف آباد",
    "شهريار",
    "فشم",
    "فيروزكوه",
    "قدس",
    "قرچك",
    "كهريزك",
    "لواسان",
    "ملارد",
    "ورامين",
    "پاكدشت",
    "چهاردانگه",
  ],
  "چهارمحال بختياري": ["اردل", "بروجن", "شهركرد", "فارسان", "لردگان", "چلگرد"],
  "خراسان جنوبي": ["بيرجند", "سربيشه", "فردوس", "قائن", "نهبندان"],
  "خراسان رضوي": [
    "تايباد",
    "تربت جام",
    "تربت حيدريه",
    "خواف",
    "درگز",
    "سبزوار",
    "سرخس",
    "طبس",
    "طرقبه",
    "فريمان",
    "قوچان",
    "كاشمر",
    "مشهد",
    "نيشابور",
    "چناران",
    "گناباد",
  ],
  "خراسان شمالي": ["آشخانه", "اسفراين", "بجنورد", "جاجرم", "شيروان"],
  خوزستان: [
    "آبادان",
    "انديمشك",
    "اهواز",
    "ايذه",
    "ايرانشهر",
    "باغ ملك",
    "بندر امام خميني",
    "بندر ماهشهر",
    "بهبهان",
    "حمیدیه",
    "خرمشهر",
    "دزفول",
    "رامشیر",
    "رامهرمز",
    "سوسنگرد",
    "شادگان",
    "شادگان",
    "شوش",
    "شوشتر",
    "لالي",
    "مسجد سليمان",
    "ملاثانی",
    "هنديجان",
    "هويزه",
  ],
  زنجان: ["آب بر", "ابهر", "خدابنده", "خرمدره", "زنجان", "قيدار", "ماهنشان"],
  سمنان: ["ايوانكي", "بسطام", "دامغان", "سمنان", "شاهرود", "گرمسار"],
  "سيستان و بلوچستان": [
    "ايرانشهر",
    "خاش",
    "زابل",
    "زاهدان",
    "سراوان",
    "سرباز",
    "ميرجاوه",
    "چابهار",
  ],
  فارس: [
    "آباده",
    "اردكان",
    "ارسنجان",
    "استهبان",
    "اقليد",
    "بوانات",
    "جهرم",
    "حاجي آباد",
    "خرامه",
    "خنج",
    "داراب",
    "زرقان",
    "سروستان",
    "سوريان",
    "سپيدان",
    "شيراز",
    "صفاشهر",
    "فراشبند",
    "فسا",
    "فيروز آباد",
    "كازرون",
    "لار",
    "لامرد",
    "مرودشت",
    "مهر",
    "کوار",
  ],
  قزوين: ["آبيك", "بوئين زهرا", "تاكستان", "قزوين"],
  قم: ["قم"],
  کرج: ["اشتهارد", "طالقان", "كرج", "ماهدشت", "نظرآباد", "هشتگرد"],
  كردستان: [
    "بانه",
    "بيجار",
    "حسن آباد",
    "سقز",
    "سنندج",
    "صلوات آباد",
    "قروه",
    "مريوان",
  ],
  كرمان: [
    "انار",
    "بافت",
    "بردسير",
    "بم",
    "جيرفت",
    "راور",
    "رفسنجان",
    "زرند",
    "سيرجان",
    "كرمان",
    "كهنوج",
    "کوهبنان",
  ],
  كرمانشاه: [
    "اسلام آباد غرب",
    "جوانرود",
    "سنقر",
    "صحنه",
    "قصر شيرين",
    "كرمانشاه",
    "كنگاور",
    "هرسين",
    "پاوه",
  ],
  "كهكيلويه و بويراحمد": ["دهدشت", "دوگنبدان", "سي سخت", "ياسوج", "گچساران"],
  گلستان: [
    "آزاد شهر",
    "آق قلا",
    "راميان",
    "علي آباد كتول",
    "كردكوی",
    "كلاله",
    "گرگان",
    "گنبد كاووس",
  ],
  گيلان: [
    "آستارا",
    "املش",
    "تالش",
    "رشت",
    "رودبار",
    "شفت",
    "صومعه سرا",
    "فومن",
    "لاهیجان",
    "لنگرود",
    "ماسال",
    "ماسوله",
    "منجيل",
    "هشتپر",
  ],
  لرستان: [
    "ازنا",
    "الشتر",
    "اليگودرز",
    "بروجرد",
    "خرم آباد",
    "دزفول",
    "دورود",
    "كوهدشت",
    "ماهشهر",
    "نور آباد",
  ],
  مازندران: [
    "آمل",
    "بابل",
    "بابلسر",
    "بلده",
    "بهشهر",
    "تنكابن",
    "جويبار",
    "رامسر",
    "ساري",
    "قائم شهر",
    "محمود آباد",
    "نكا",
    "نور",
    "نوشهر",
    "چالوس",
  ],
  مركزي: ["آشتيان", "اراك", "تفرش", "خمين", "دليجان", "ساوه", "شازند", "محلات"],
  هرمزگان: [
    "بستك",
    "بندر جاسك",
    "بندر خمیر",
    "بندر لنگه",
    "بندرعباس",
    "حاجي آباد",
    "دهبارز",
    "قشم",
    "قشم",
    "كيش",
    "ميناب",
  ],
  همدان: ["اسدآباد", "بهار", "رزن", "ملاير", "نهاوند", "همدان"],
  يزد: [
    "ابركوه",
    "اردكان",
    "اشكذر",
    "بافق",
    "تفت",
    "خضرآباد",
    "زارچ",
    "طبس",
    "مهريز",
    "ميبد",
    "هرات",
    "يزد",
  ],
};

const Location = ({ handleCompleteStep, setProduct, productInfo }) => {
  const [countryOptions, setCountryOptions] = useState([]);
  const [proviceOptions, setProviceOptions] = useState([]);
  const [cityOptions, setCityOptions] = useState([]);

  const getCountryOptions = () => {
    let options = [];
    options = countries.map((country) => {
      return { label: country, value: country };
    });
    return options;
  };

  const getProvincesOptions = () => {
    let options = [];
    Object.keys(provinces_with_cities).map((key) => {
      options.push({
        label: key,
        value: key,
      });
    });

    return options;
  };

  const getCitiesOptions = () => {
    let options = [];
    if (productInfo.state) {
      options = provinces_with_cities[productInfo.state.value].map((city) => {
        return {
          value: city,
          label: city,
        };
      });
    }
    return options;
  };

  const handleClick = () => {
    if (!productInfo.state || !productInfo.city || !productInfo.country) {
      _toast.error("پر کردن تمامی فیلد های ادرس الزامی است.");
    } else {
      handleCompleteStep();
    }
  };

  useEffect(() => {
    setCountryOptions(getCountryOptions());
  }, []);

  useEffect(() => {
    setProviceOptions(getProvincesOptions());
  }, [productInfo.country]);

  useEffect(() => {
    setCityOptions(getCitiesOptions());
  }, [productInfo.state]);

  return (
    <div>
      <p className="text-secondary bg-color8 rounded-[22px] h-[55px] flex items-center justify-center w-fit px-[2rem] mx-auto mt-[5rem] mb-[6rem]">
        موقعیت جفرافیایی محصول خود را در صورت نیاز انتخاب کنید.
      </p>
     <div>
     <div className="my-[2rem] relative">
        <SelectBox
          options={countryOptions}
          selected={productInfo.country}
          setSelected={(item) => {
            setProduct("country", item);
          }}
          label="کشور"
        />
      </div>
      <div className="my-[2rem] relative">
        <SelectBox
          options={proviceOptions}
          selected={productInfo.state}
          setSelected={(item) => {
            setProduct("state", item);
          }}
          label="استان"
        />
      </div>
      <div className="my-[2rem] relative">
        <SelectBox
          options={cityOptions}
          selected={productInfo.city}
          setSelected={(item) => {
            setProduct("city", item);
          }}
          label="شهر"
        />
      </div>
     </div>
      <Button
        onClick={() => handleClick()}
        className="w-[20rem] h-[4rem] btn-primary mt-[13.5rem] block mr-auto"
      >
        مرحله بعد
      </Button>
    </div>
  );
};

export default Location;
