import Head from "next/head";
import PicturIcon from '@/public/icons/FillPictureActive.svg';
import VideoIcon from '@/public/icons/FillVideoActive.svg';
import MusicIcon from '@/public/icons/FillMusicDisable.svg';
import ThemeIcon from '@/public/icons/FillThemeDisable.svg';
import {BsTelephoneFill} from "react-icons/bs";
import {FaTelegramPlane} from "react-icons/fa";
import {AiFillMail} from "react-icons/ai";
import {HiLocationMarker} from "react-icons/hi";

export const InfoItemData = [
  {
    title: 'تصویر',
    value: 1354,
    icon: <PicturIcon className="scale-[0.7]"/>
  },
  {
    title: 'ویدئو',
    value: 1354,
    icon: <VideoIcon className="scale-[0.7]"/>
  },
  {
    title: 'صوت',
    value: null,
    icon: <MusicIcon className="scale-[0.7]"/>
  },
  {
    title: 'تمپلیت',
    value: null,
    icon: <ThemeIcon className="scale-[0.7]"/>
  },
]
const contactBoxes = [
  {
    connectionWay: 'شماره تلفن',
    value: "09018899554",
    icon: <BsTelephoneFill className="text-primary text-3xl"/>
  },
  {
    connectionWay: 'آیدی تلگرام',
    value: <a href={"https://t.me/valadmin"} target={"_blank"} rel={"noreferrer"}>@valadmin</a>,
    icon: <FaTelegramPlane className="text-primary text-3xl"/>
  },
  {
    connectionWay: 'ایمیل',
    value: "valavid_official@yahoo.com",
    icon: <AiFillMail className="text-primary text-3xl"/>
  },
  {
    connectionWay: 'آدرس',
    value: "تهران، چهارراه تئاتر شهر، نبش خ راضی، پلاک 1034",
    icon: <HiLocationMarker className="text-primary text-3xl"/>
  },
]

export default function index() {
  return (
    <>
      <Head>
        <title>والاوید | درباره ی ما</title>
        <meta name="viewport" content="width=device-width, initial-scale=1"/>
      </Head>
      <div className="relative">
        <div className="flex container">
          <div className="my-20">
            <h1 className={"text-2xl"}>آشنایی مقدماتی با والاوید</h1>
            <p className="text-gray text-lg text-justify leading-[3.5rem]">
              سایت والاوید با هدف پشتیبانی و تامین محتوای تصویری جهت استفاده تدوین‌گران، طراحان، فیلمسازان، تصویربرداران
              و فعالان حوزه رسانه فعالیت خود را آغاز کرده است. این پلتفرم قصد دارد برای هنرمندان، کسانی که تمایل دارند
              ایران اسلامی‌و سبک زندگی ایرانیان را بشناسند و‌یا آثار هنری خود را در این زمینه تولید کنند، ویدئو فوتیج‌یا
              تکه ویدئو های مرتبط با آنچه مورد نظر است را منتشر نماید. بدیهی است این امر مستلزم رعایت قوانین حاکم بر
              رسانه و حقوق مولف در جمهوری اسلامی‌ایران است و این سایت خود را در چارچوب این قوانین و ضوابط تعریف
              می‌نماید.<br/>
              کاربران سایت والاوید این امکان را دارند که با ارائه‌ی اطلاعات خود و احراز آنلاین آن از مراجع قانونی به
              عضویت سایت درآمده و نسبت به بارگیری (دانلود) و بارگذاری (آپلود) محصولات سایت اقدام نمایند. تمامی‌محتویات و
              محصولات این سایت مشمول قانون حق انتشار(کپی رایت) بوده و حقوق آن برای سایت والاوید به لحاظ قانونی و شرعی
              محفوظ است. بنابراین انتشار این آثار در قالب لوح های فشرده، بارگذاری های اینترنتی، کپی و... حق پیگیرد
              قانونی را برای سایت به همراه خواهد داشت. والاوید از طرف کلیه تولیدکنندگان محصولات سایت، وکالت دارد تا در
              صورت نقض حقوق مولف و نیز استفاده غیر منصفانه از آثار بارگذاری شده، از طریق تیم حقوقی والاوید به مراجع ذی
              صلاح قانونی موضوع را پیگیری نماید.<br/>
              استفاده‌ی کاربران از سایت والاوید با این پیش فرض است که قوانین پیش رو را به دقت مطالعه نموده، موافق بوده و
              نسبت به تایید آن هنگام عضویت اقدام کرده اند و نیز شرایط قانونی استفاده از آن را دارد. فرض بر آن است که
              همه‌ی کاربران الزاما اطلاعات واقعی و صحیح خود را اظهار کرده و مسئولیت اقدامات انجام شده در صفحات ویژه خود
              (پروفایل) را دارند. توصیه می‌شود نسبت به حفظ نام کاربری و رمز عبور نزد صاحب صفحه شخصی حداکثر احتیاط صورت
              پذیرد و بعد از چند مدت با رمز معتبر دیگر جایگزین گردد. سایت والاوید خود را در قبال اطلاعات شخصی کاربران
              مسئول دانسته و آن را در اختیار دیگران قرار نخواهد داد. تمامی‌اقدامات کاربران در حافظه‌ی پروفایل اشخاص ثبت
              گردیده و امکان بازیابی آن وجود خواهد داشت. سایت والاوید از این اطلاعات جهت ارائه‌ی خدمات بهتر و متناسب با
              نیاز کاربران استفاده می‌نماید.<br/>
              کاربران غیرایرانی این سایت باید توجه داشته باشند که کلیه مناسبات حقوقی میان این مجموعه و ایشان مطابق قانون
              داخلی جمهوری اسلامی‌ایران تعیین می‌گردد. جهت اطلاع از حقوق و انتظارات سایت از کاربران مطالعه این قوانین
              الزامی‌بوده و در صورتی که نکات مبهمی‌باقی بماند، مرجع تصمیم گیری تنها قوانین و ضوابط مربوط به رسانه های
              دیجیتال و مطبوعات اینترنتی جمهوری اسلامی‌ایران با سازمان تنظیم مقررات رسانه های صوت و تصویر فراگیر در فضای
              مجازی، ساترا، است. اطلاع از این قوانین شرط اساسی در استفاده از سایت والاوید بوده و تقاضا می‌گردد تنها در
              صورتی که با همه این قوانین موافق هستید، از این سایت استفاده نمایید. خاطر نشان می‌گردد تنها مرجع قانونی در
              استفاده و انتشار محتویات این سایت، مجمع قضایی جمهوری اسلامی‌ایران است و قوانین بین المللی تنها در راستای
              قوانین جمهوری اسلامی‌ایران معتبر خواهند بود. توصیه اکید این مجموعه مشورت با حقوقدانان بین المللی مسلط به
              قوانین رسانه ای جمهوری اسلامی‌ایران قبل از استفاده و خرید محصولات این سایت است. جهت اطلاع از اصول و ضوابط
              حاکم بر انتشار محتوای نمایشی ذر فضای مجازی می توانید
              <a className={"text-primary"}
                 href={"https://satra.ir/wp-content/uploads/2022/08/990402-%D8%AF%D9%81%D8%AA%D8%B1%DA%86%D9%87-%D8%B6%D9%88%D8%A7%D8%A8%D8%B7-%D9%86%D9%85%D8%A7%DB%8C%D8%B4%DB%8C-1.pdf"}> اینجا </a> کلیک
              کنید.

            </p>
            <h2 className={"mt-10 text-2xl"}>هویت والاوید</h2>
            <p className="text-gray text-lg text-justify leading-[3.5rem]">
              سایت والاوید از قوانین جمهوری اسلامی‌تبعیت کرده و کاربران آن نیز از هر کشور که باشند، موظف به رعایت قوانین
              حاکم بر فضای رسانه در جمهوری اسلامی‌ایران هستند.<br/>
              کاربران کسانی هستند که با ارائه اطلاعات صحیح خود در سایت عضو شده و اقدام به خرید و بارگیری (دانلود)
              محصولات می‌نمایند.<br/>
              تولیدکنندگان کسانی هستند که با ارائه اطلاعات کاربری و ثبت درخواست جهت تبدیل وضعیت به فروشندگی، محصولاتی که
              مالکیت مادی آن را دارند، بارگذاری کرده و مسئولیت انتشار آن اثر را ضمن حفظ مالکیت معنوی میپذیرند.<br/>
              کاربران موظف‌اند اطلاعات مورد نیاز جهت ثبت نام در سایت را به صورت واقعی و صحیح وارد نمایند در غیر این صورت
              سایت والاوید امکان تعلیق و‌یا لغو فعالیت کاربر را خواهد داشت. چنانچه اطلاعات پروفایل شما مغایر با قوانین
              جمهوری اسلامی‌ایران و شئونات اسلامی‌باشد، سایت می‌تواند اقدامات مقتضی را انجام دهد.<br/>
              فروش محصولات در این پلتفرم به معنای واگذاری حقوق معنوی آثار نیست و کلیه کاربران موظف هستند جهت رعایت حقوق
              مولف، نام ناشر و محل عرضه محصولات را ذکر نمایند.<br/>
              مسئولیت انتشار آثاری که نقض حقوق مولف در آن مشاهده شود، بر عهده کاربری است که آن را منتشر کرده است.<br/>
              والاوید در صورت دریافت گزارش در خصوص نقض حقوق مولف، ضمن اخطار به کاربر و حذف محصول، حق شکایت را برای خود
              به منظور اعاده حیثیت و اعتبار محصولات پلتفرم محفوظ می‌داند.
            </p>
            <h2 className={"mt-10 text-2xl"}>حقوق کاربران در والاوید</h2>
            <p className="text-gray text-lg text-justify leading-[3.5rem]">
              سایت والاوید از اطلاعات وارد شده جهت ارائه‌ی پیشنهادات ویژه فروش، اطلاع رسانی از جدیدترین محصولات بارگذاری
              شده، مجلات و مقالات هنری و محصولات رسانه ای استفاده خواهد کرد.<br/>
              سایت والاوید متعهد است از اطلاعات شخصی وارد شده در بخش کاربری حفاظت کرده و از انتشار عمومی آن جلوگیری
              نماید.<br/>
              ثبت نام در سایت مستلزم موافقت با قوانین سایت هنگام ثبت نام و نسخه های به روز رسانی شده قوانین در مرحله های
              بعد است. بنابراین اطلاع از آخرین تغییرات قوانین سایت بر عهده‌ی کاربران می‌باشد.<br/>
              سایت والاوید متعهد می‌گردد آخرین تغییرات و اطلاحات قوانین را با درج زمان ثبت و اقدام موثر آن به اطلاع
              کاربران برساند.<br/>
              در صورتی که کاربر با بخشی از قوانین به روز رسانی شده مخالف باشد می‌تواند نسبت به خروج از سایت و حذف صفحه‌ی
              کاربری خود اقدام نماید. مناسبات حقوقی بین سایت و کاربران بعد از لغو فعالیت های کاربری و حذف صفحه همچنان
              پابرجا بوده و لازم به ذکر است این روابط مطابق آخرین نسخه قوانین بارگذاری شده تعیین می‌شود.<br/>
              مسئولیت صفحات کاربری (پروفایل) متوجه مالک اصلی آن است و هر گونه اقدامی‌که با نام کاربری خاص صورت بگیرد، با
              مسئولیت حقوقی صاحب صفحه می‌باشد. بنابراین کاربران باید نسبت به نام کاربری و رمز ورود خود نهایت دقت را مد
              نظر قرار دهند.<br/>
              محصولات سایت والاوید برای همه‌ی سنین ارائه می‌شود و این سایت هیچ مسئولیتی را در خصوص عملیات خرید افراد
              کمتر از سن قانونی (15 سال) به عهده نمی‌گیرد. بنابراین لازم است تا افرادی که سن کمتری دارند با رضایت
              والدین‌یا قیم قانونی خود نسبت به خرید اقدام نمایند.<br/>
              مسئولیت مالکیت کارت اعتباری مورد استفاده‌ی کاربران و منشأ هزینه های پرداخت شده بر عهده‌ی ایشان بوده و سایت
              مسئولیتی را در این باره تعهد نمی‌کند.<br/>
              همه‌ی محصولات با قیمت و ارزش ریالی مندرج در کنار محصول، متناسب با کیفیت و نوع محصول به فروش می‌رسد. در
              صورت هر گونه خطا در محاسبه‌ی مبالغ درج شده، سایت والاوید متعهد به پرداخت مابه التفاوت در اسرع وقت می‌باشد.<br/>
              کاربران موظف اند از محصولات بارگذاری شده در سایت هیچ سوءاستفاده ای نکنند. بدین منظور هر گونه استفاده از
              محصولات سایت در توهین به ملیت ها، قومیت ها، مقدسات، مخالفت با مسائل عرفی، اخلاقی و فرهنگی جامعه ایران،
              جریان های سیاسی، افراد شاخص و شهروندان مطابق قوانین جمهوری اسلامی‌ایران جرم انگاری شده و حق شکایت از
              سازندگان فیلم برای سایت والاوید محفوظ است. حدود قانونی این دستور العمل توسط سازمان تنظیم مقررات صوت و
              تصویر فراگیر برای پلتفرم ها
              <a className={"text-primary"}
                 href={"https://satra.ir/wp-content/uploads/2022/08/990402-%D8%AF%D9%81%D8%AA%D8%B1%DA%86%D9%87-%D8%B6%D9%88%D8%A7%D8%A8%D8%B7-%D9%86%D9%85%D8%A7%DB%8C%D8%B4%DB%8C-1.pdf"}> اینجا </a> کلیک
              مشخص شده است.<br/>
              مسئولیت تشخیص توهین، افتراء، تشویش اذهان عمومی‌و اقدامات علیه امنیت ملی ایران بر عهده سازمان تنظیم مقررات
              صوت و تصویر فراگیر بر اساس قوانین جمهوری اسلامی‌ایران بوده و به همه‌ی کاربران توصیه می‌گردد نسبت به رعایت
              این امر مهم نهایت اهتمام را داشته باشند. کلیه تصمیم گیری های قضایی بین المللی در این زمینه بی اثر بوده و
              از جانب این سایت به عنوان مالک اصلی و صاحب امتیاز این محصولات مردود شناخته می‌شود.<br/>
              مسئولیت بررسی اولیه محصولات کاربران به جهت احراز استاندارد های فنی و محتوایی، بر عهده تیم پشتیبانی والاوید
              است و در صورت نقض مقررات سایت، ضمن اعلام علت به مالک محصول، مجوز انتشار صادر نمی‌شود.
            </p>

            <h2 className={"mt-10 text-2xl"}>قوانین فروش محصولات</h2>

            <p className="text-gray text-lg text-justify leading-[3.5rem]">
              پس از خرید محصولات و پرداخت هزینه، به هیچ عنوان وجه عودت داده نمی‌شود بنابراین کاربران باید نسبت به انتخاب
              محصولات مورد نظر دقت کافی داشته باشند. سایت والاوید متعهد است خرابی لینک های فروش و اشکالات مقطعی که موجب
              عدم دسترسی کاربران به محصول خریداری شده می‌شود را در اسرع وقت اصلاح و پیگیری نماید.
            </p>

            <h2 className={"mt-10 text-2xl"}>حق مالکیت معنوی</h2>

            <p className="text-gray text-lg text-justify leading-[3.5rem]">
              مالکیت معنوی کلیه محصولات بارگذاری شده در سایت والاوید برای خالق اثر بوده و این مالکیت هرگز با خریداری
              محصولات منتقل نمی‌شود.<br/>
              خریداری محصولات سایت و انتشار آن بدون ذکر نام صاحب امتیاز و محل عرضه جهت شرکت در جشنواره ها و هرگونه
              عملیات متقلبانه که حقوق معنوی سایت را به مخاطره اندازد پیگیرد حقوقی والاوید را به همراه خواهد داشت.<br/>
              تولیدکنندگان والاوید در زمینه استیفای حقوق معنوی خود، امتیاز پیگیری حقوقی نقض حقوق مولف را به پلتفرم
              واگذار کرده اند. بدیهی است این وکالت می تواند با تصریح کاربر، از اعتبار ساقط گردد.<br/>
              والاوید در جهت انجام مسئولیت اجتماعی خود، به دنبال ساماندهی سازمان مدیریت جمعی (CMO) به منظور صیانت از
              حقوق مولفین تکه ویدئو یا فوتیج است. پذیرش وکالت پیگیری حقوقی نقض حقوق مولف کاربران والاوید از این روی حسب
              مورد انجام خواهد شد.
            </p>

            <h2 className={"mt-10 text-2xl"}>تعهدات والاوید</h2>

            <p className="text-gray text-lg text-justify leading-[3.5rem]">
              هرگونه آسیب وارد شده به سیستم های کاربران چه از نوع نرم افزاری و چه سخت افزاری خارج از تعهدات سایت بوده و
              سایت والاوید وظیفه ای در جبران خسارات صورت گرفته ندارد.<br/>
              سایت والاوید مفتخر است با هنرمندان عرصه‌ی فیلمسازی همکاری های متعدد و منحصر به فردی داشته است. به این
              منظور فیلم ها، عکس ها و تصویرسازی های گرافیکی مطابق قرارداد های جداگانه مورد تعامل قرار گرفته است. جهت
              اطلاع از کیفیت این قرارداد و تعاملات ثانوی با روابط عمومی ‌سایت از طریق پروفایل خود ارتباط برقرار
              نمایید.<br/>
              در صورتی که هر فرد، شرکت، جریانات سیاسی، اقلیت های قومی‌و مذهبی، فعالان عرصه‌ی اخلاق و فرهنگ معتقد باشند
              بر اثر محتویات این سایت مورد بی احترامی‌واقع شده اند و‌یا حقوقی از آنها تضییع شده است، فورا اطلاعات و
              اسنادی که ادعای ایشان را اثبات کند و هرگونه موارد مربوط به این امر را به اطلاع روابط عمومی‌سایت
              برسانند.<br/>
              سایت والاوید خود را موظف می‌داند که در راستای حمایت از ارزش های مادی و معنوی جامعه و شهروندان، حداکثر
              همکاری را با ایشان انجام دهند.<br/>
              سایت والاوید با استفاده از عبارات جستجو شده توسط کاربران، تماشای فیلم ها، علاقه مندی ها و سایر اطلاعات جمع
              آوری شده از مخاطبین خود، فعالیت های آینده‌ی خود را با تمرکز بر این موارد به حالت مطلوب‌تر تنظیم
              می‌نماید.<br/>
              این کار صرفا با هدف ارائه خدمات بهتر به کاربران صورت می‌گیرد.<br/>
              با ورود به صفحات سایت والاوید، بخش هایی از تبلیغات گروه ها و سایت های دیگر به چشم میخورد. سایت والاوید هر
              گونه تایید و موافقت خود را نسبت به محتوای تبلیغات رد کرده و صحت اطلاعات آن را به کاربران خود واگذار
              می‌نماید. بنابراین هیچ نسبتی بین این سایت و تبلیغات صورت گرفته وجود نخواهد داشت و مسئولیت استفاده از آن
              صرفا بر عهده‌ی کاربران خواهد بود.
            </p>
          </div>
        </div>
      </div>
    </>
  )
}
